Feature: GradeCalculator
	In order to ป้องกันข้อผิดพลาดในการตัดเกรดของช่วงคะแนนต่างๆ
	As a อาจารย์
	I want to ให้เกรดนักเรียนจากคะแนนสอบ

Background: ระบบมีข้อมูลเบื้องต้นให้ดังนี้
	Given เกณฑ์การประเมินเกรดในระบบเป็นดังนี้
	| MinScore | Grade |
	| 91       | A     |
	| 81       | B     |
	| 71       | C     |
	| 61       | D     |
	| 0        | F     |

Scenario: ใส่ข้อมูลที่ได้คะแนน 60 จะต้องได้เกรด F
	Given นักเรียนได้คะแนนสอบ '60' คะแนน
	When ทำการประเมินเกรด
	Then ผลการประเมินจะต้องได้เกรด 'F'

Scenario: ใส่ข้อมูลที่ได้คะแนน 70 จะต้องได้เกรด D
	Given นักเรียนได้คะแนนสอบ '70' คะแนน
	When ทำการประเมินเกรด
	Then ผลการประเมินจะต้องได้เกรด 'D'

Scenario: ใส่ข้อมูลที่ได้คะแนน 80 จะต้องได้เกรด C
	Given นักเรียนได้คะแนนสอบ '80' คะแนน
	When ทำการประเมินเกรด
	Then ผลการประเมินจะต้องได้เกรด 'C'

Scenario: ใส่ข้อมูลที่ได้คะแนน 90 จะต้องได้เกรด B
	Given นักเรียนได้คะแนนสอบ '90' คะแนน
	When ทำการประเมินเกรด
	Then ผลการประเมินจะต้องได้เกรด 'B'

Scenario: ใส่ข้อมูลที่ได้คะแนน 95 จะต้องได้เกรด A
	Given นักเรียนได้คะแนนสอบ '95' คะแนน
	When ทำการประเมินเกรด
	Then ผลการประเมินจะต้องได้เกรด 'A'

Scenario: ใส่ข้อมูลที่ได้คะแนนเกิน 90 ขึ้นไปจะต้องได้เกรด A
	Given นักเรียนได้คะแนนสอบ '<score>' คะแนน
	When ทำการประเมินเกรด
	Then ผลการประเมินจะต้องได้เกรด 'A'

	Examples: 
	| score |
	| 91    |
	| 99    |
	| 100   |

@exception
Scenario: ใส่ข้อมูลที่ได้คะแนนไม่ถูกต้อง ระบบจะต้องแจ้งเตือนข้อผิดพลาด
	Given นักเรียนได้คะแนนสอบ '<score>' คะแนน
	When ทำการประเมินเกรด
	Then ระบบจะต้องแจ้งเตือนข้อผิดพลาด

	Examples: 
	| score |
	| -65   |
	| 120   |