Feature: GradeCalculator
	In order to ป้องกันข้อผิดพลาดในการตัดเกรดของช่วงคะแนนต่างๆ
	As a อาจารย์
	I want to ให้เกรดนักเรียนจากคะแนนสอบ

Background: ระบบมีข้อมูลเบื้องต้นให้ดังนี้
	Given เกณฑ์การประเมินเกรดในระบบเป็นดังนี้
	| MinScore | Grade |
	| 91       | A     |
	| 81       | B     |
	| 71       | C     |
	| 61       | D     |
	| 0        | F     |

Scenario: ใส่ข้อมูลที่ได้คะแนนต่ำกว่า 60 จะต้องได้เกรด F
	Given นักเรียนได้คะแนนสอบ '<score>' คะแนน
	When ทำการประเมินเกรด
	Then ผลการประเมินจะต้องได้เกรด '<expectedGrade>'

	Examples: 
	| score | expectedGrade |
	| 30    | F             |
	| 60    | F             |
	| 51    | F             |

Scenario: ใส่ข้อมูลที่ได้คะแนนตั้งแต่ 91 ขึ้นไปจะต้องได้เกรด A
	Given นักเรียนได้คะแนนสอบ '<score>' คะแนน
	When ทำการประเมินเกรด
	Then ผลการประเมินจะต้องได้เกรด 'A'

	Examples: 
	| score |
	| 91    |
	| 99    |
	| 100   |